{"status":"ok","totalResults":31478,"articles":[{"source":{"id":"engadget","name":"Engadget"},"author":"Kris Holt","title":"Sony is making an Until Dawn movie","description":"Sony is continuing to mine its back catalog of games for movie adaptations while conveniently continuing to forget that Bloodborne is right there. The next game that's bound for the big screen is Until Dawn, a 2015 interactive horror title that Supermassive G…","url":"https://www.engadget.com/sony-is-making-an-until-dawn-movie-211729859.html","urlToImage":"https://s.yimg.com/os/creatr-uploaded-images/2024-01/5ee25f10-b57c-11ee-afe9-fd9eaffa439f","publishedAt":"2024-01-17T21:17:29Z","content":"Sony is continuing to mine its back catalog of games for movie adaptations while persistently forgetting that Bloodborne is right there. Its next game that's bound for the big screen is Until Dawn, a… [+1390 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Sabina Graves","title":"The Barbie Movie Begets Barbie Movie Dolls","description":"In the year that Greta Gerwig’s Barbie movie is a major awards contender—with a script the director co-wrote, starring and produced by Margot Robbie, and an incredible ensemble of female talent—women in film are still a majorly marginalized group. Mattel, no …","url":"https://gizmodo.com/barbie-film-dolls-greta-gerwig-margot-robbie-mattel-1851156414","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/55e5d58ee79c6b99e2dd1edb5d57cdbc.png","publishedAt":"2024-01-11T01:30:00Z","content":"In the year that Greta GerwigsBarbiemovie is a major awards contenderwith a script the director co-wrote, starring and produced by Margot Robbie, and an incredible ensemble of female talentwomen in f… [+820 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Angela Watercutter","title":"'The Mandalorian' Is Getting a Movie—Which It Should Have Been All Along","description":"Many of the Star Wars shows on Disney+ were often just overly long movies in disguise. Bringing \"The Mandalorian and Grogu\" to the big screen rights that.","url":"https://www.wired.com/story/the-mandalorian-and-grogu-movie-coming/","urlToImage":"https://media.wired.com/photos/659d9323fee15b2b6c7238be/191:100/w_1280,c_limit/Mandalorian-Movie-Culture-TM4__SET_MandoVShipExplosionEXT_231104_v035__RYCH.jpg","publishedAt":"2024-01-09T20:03:51Z","content":"Today in news we werent expecting in the second week of 2024: The Mandalorian is getting a movie. Titled The Mandalorian &amp; Grogu, the movie, according to Lucasfilm, will begin production this yea… [+2578 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Sony's El Muerto Movie Should Exist This Weekend","description":"A full month from now, Madame Web will be making its way into theaters. Like Venom and Morbius before it, the film is Sony’s bid at making a universe of interconnected Spider-Man movies that don’t feature the hero in question. And in another universe, we’d ha…","url":"https://gizmodo.com/el-muerto-movie-spider-man-original-release-1851165301","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/de4612174576ee3782d3631524cceea2.jpg","publishedAt":"2024-01-13T19:45:00Z","content":"A full month from now, Madame Web will be making its way into theaters. Like Venomand Morbiusbefore it, the film is Sonys bid at making a universe of interconnected Spider-Man movies that dont featur… [+3338 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"James Whitbrook","title":"Star Trek's Section 31 Movie Has Found Its Stars","description":"The next Star Trek movie is upon us, and no, it’s not got anything to do with Chris Pine or Jean-Luc Picard: Michelle Yeoh is back in sneaky action for Star Trek: Section 31, and Paramount has found her co-stars.Read more...","url":"https://gizmodo.com/star-trek-section-31-movie-michelle-yeoh-cast-paramount-1851209122","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/42c189624397981d2e72bcc1407ec44e.png","publishedAt":"2024-01-30T17:20:00Z","content":"The next Star Trek movie is upon us, and no, its not got anything to do with Chris Pine or Jean-Luc Picard: Michelle Yeoh is back in sneaky action for Star Trek: Section 31, and Paramount has found h… [+1310 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"No, Rey's Star Wars Movie Hasn't Been Delayed","description":"You can take that latest Star Wars rumor and throw it in the sarlacc pit. Earlier this week, rumors surfaced that the upcoming Sharmeen Obaid-Chinoy Star Wars film featuring the return of Daisy Ridley as Rey had been delayed indefinitely. The reason? Creative…","url":"https://gizmodo.com/star-wars-rey-movie-rumors-delay-lucasfilm-disney-1851169333","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/2f68fe4fbbbd23da60b4d9113cee4a3e.jpg","publishedAt":"2024-01-16T18:30:00Z","content":"You can take that latest Star Wars rumor and throw it in the sarlacc pit. Earlier this week, rumors surfaced that the upcoming Sharmeen Obaid-Chinoy Star Wars film featuring the return of Daisy Ridle… [+1884 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"Ryan Coogler's Top Secret New Movie Could Team Michael B. Jordan With Vampires","description":"Ryan Coogler and Michael B. Jordan are getting ready to make their fifth movie together and, for the first time ever, this one is going to suck. That’s because it’s about vampires. Or so the rumors say.Read more...","url":"https://gizmodo.com/ryan-coogler-new-movie-michael-b-jordan-vampires-creed-1851179971","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/2adefe3af01e2f0143dfe27d1b7aa12b.jpg","publishedAt":"2024-01-19T17:40:00Z","content":"Ryan Coogler and Michael B. Jordan are getting ready to make their fifth movie together and, for the first time ever, this one is going to suck. Thats because its about vampires. Or so the rumors say… [+1860 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Cheryl Eddy","title":"A New Evil Dead Movie Is Coming, But How It Fits Is a Mystery","description":"Last year, Lee Cronin’s Evil Dead Rise put a fresh coat of (pleasingly gory) paint on the much-loved cult horror franchise. Now, there are rumblings anew for the 43-year-old series: a film from emerging horror star Sébastien Vaniček, whose Infested thrilled a…","url":"https://gizmodo.com/evil-dead-spin-off-movie-raimi-infested-spider-horror-1851227157","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/36c2bffa20cf001d527683ca58af046e.jpg","publishedAt":"2024-02-05T22:30:00Z","content":"Last year, Lee Cronins Evil Dead Rise put a fresh coat of (pleasingly gory) paint on the much-loved cult horror franchise. Now, there are rumblings anew for the 43-year-old series: a film from emergi… [+2045 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Todd McFarlane's Ready to Make the Spawn Movie If Hollywood Won't","description":"Every other year or so, Todd McFarlane has promised that no, really, the new Spawn movie’s totally going to happen! And each time, it’s started to feel less and less like a sure thing, even as Hollywood’s been more than willing get adaptations for literally a…","url":"https://gizmodo.com/spawn-movie-2024-deadline-hollywood-todd-mcfarlane-1851146945","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/9482133279f4e7a62b2c30f208c308df.png","publishedAt":"2024-01-07T19:50:00Z","content":"Every other year or so, Todd McFarlane has promised that no, really, the new Spawn movies totally going to happen! And each time, its started to feel less and less like a sure thing, even as Hollywoo… [+2357 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Sabina Graves","title":"20 Nostalgic Collectibles From the Golden Age of Fast-Food Movie Tie-Ins","description":"Remember fast-food kids meals with specially marketed pop culture toys? They just don’t make ‘em like they used to. In the 1990s, Taco Bell, KFC, Pizza Hut, McDonald’s, and Burger King often chose chaos with their tie-ins, like the Batman Forever glass mugs o…","url":"https://gizmodo.com/nostalgic-retro-fast-food-toys-star-wars-batman-disney-1851209486","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/415a4fa51fed093d19c9bfb9069d338b.png","publishedAt":"2024-01-31T22:30:00Z","content":"Remember fast-food kids meals with specially marketed pop culture toys? They just dont make em like they used to. In the 1990s, Taco Bell, KFC, Pizza Hut, McDonalds, and Burger King often chose chaos… [+561 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Reece Rogers","title":"Where to Stream 2024’s Best Picture Oscar Nominees","description":"'Oppenheimer,' 'Barbie,' 'Killers of the Flower Moon'—most of this year's Academy Award nominees are available to watch online. Here's where to find them.","url":"https://www.wired.com/story/stream-2024-oscar-nominated-movies-best-picture/","urlToImage":"https://media.wired.com/photos/65bd85be683a294f3d5f44f4/191:100/w_1280,c_limit/Oscars-Streaming-Guide-Culture-Everett-MCDOPPE_UV014.jpg","publishedAt":"2024-02-05T12:00:00Z","content":"No matter which movie snatches Best Picture at this years Oscars, Barbenheimer will still go down as the winner. Last summers box office face-off between Christopher Nolans historical drama about a t… [+3554 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Wait, Madame Web Is a Period Piece?","description":"Ever since Sony revealed it was working on a solo movie for Madame Web, folks have had questions. Why her? How is this going to connect to whichever Spider-Man is swinging around now?Read more...","url":"https://gizmodo.com/madame-web-sony-year-timeline-1851182171","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/82a096d4b5fcc79fe7b9bb302069d829.jpg","publishedAt":"2024-01-20T18:25:00Z","content":"Ever since Sony revealed it was working on a solo movie for Madame Web, folks have had questions. Why her? How is this going to connect to whichever Spider-Man is swinging around now?\r\nIf youve watch… [+1647 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Kevin Nguyen","title":"Threads is a gripping, miserable experience","description":"Streaming as a part of Criterion Channel’s Postapocalyptic Sci-fi series, the 1984 BBC production Threads gave an unflinching (and controversial) glimpse into the effects of nuclear fallout.","url":"https://www.theverge.com/24060504/threads-review-a-miserable-experience","urlToImage":"https://cdn.vox-cdn.com/thumbor/HtaN8rOGAY_leNYrr3LjxAm3F6I=/0x0:2100x1570/1200x628/filters:focal(1050x785:1051x786)/cdn.vox-cdn.com/uploads/chorus_asset/file/25265067/threads_still.jpg","publishedAt":"2024-02-04T19:00:00Z","content":"Threads is a gripping, miserable experience\r\nThreads is a gripping, miserable experience\r\n / Four decades later, Mick Jacksons vision of the post-apocalypse is still haunting and unsparing\r\nByKevin N… [+3572 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Universal's Doing Its Monsters the Right Way","description":"Just before the weekend, Universal finally pulled back the curtain on its cryptic horror movie from filmmaking duo Radio Silence. The resulting film is Abigail, which sees Melissa Barrera and Dan Stevens headline a team of kidnappers who snatch up a kid to ho…","url":"https://gizmodo.com/abigail-radio-silence-universal-monsters-reboots-1851160597","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/a7c1a8b8e4fb362fcb6149f67f65133e.jpg","publishedAt":"2024-01-13T18:30:00Z","content":"Just before the weekend, Universal finally pulled back the curtain on its cryptic horror movie from filmmaking duo Radio Silence. The resulting film is Abigail, which sees Melissa Barrera and Dan Ste… [+3900 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"aadekaiyero@insider.com (Ayomikun Adekaiyero)","title":"Barry Keoghan's movie roles, ranked according to critics","description":"Barry Keoghan has starred in \"Saltburn,\" Marvel's \"Eternals,\" \"The Batman\" and \"Dunkirk.\"","url":"https://www.businessinsider.com/barry-keoghans-roles-ranked-saltburn-dunkirk-eternals-2024-1","urlToImage":"https://i.insider.com/65b7a7a66c8f0a134f7aa79f?width=1200&format=jpeg","publishedAt":"2024-01-30T10:38:20Z","content":"Barry Keoghan finally gets his chance to shine as the leading man in his latest movie \"Saltburn.\"\r\nOver the last few years, Keoghan has had standout performances in several major films such as \"The B… [+639 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Gordon Jackson and James Whitbrook","title":"Updates From Scream 7, Madame Web, and More","description":"Christopher Landon next film after exiting Scream 7 is a werewolf horror. Get a look at Slimer’s return in Ghostbusters: The Frozen Empire. Schmigadoon is no more. Plus, Clone High returns for round two of its revival. To me, my spoilers!Read more...","url":"https://gizmodo.com/scream-7-updates-jasmin-savoy-brown-filming-paramount-1851177789","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f41334b6e49f322ecd91a19bc7a71d9c.png","publishedAt":"2024-01-19T15:15:00Z","content":"Christopher Landon next film after exiting Scream 7 is a werewolf horror. Get a look at Slimers return in Ghostbusters: The Frozen Empire. Schmigadoon is no more. Plus, Clone High returns for round t… [+4645 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Past Lives: The film on lost love that crosses continents","description":"The Oscar-tipped film sees two childhood friends reunite and try to reconcile their separate lives.","url":"https://www.bbc.co.uk/news/entertainment-arts-67995566","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/FCDE/production/_132343746_mediaitem132343742.jpg","publishedAt":"2024-01-20T00:45:59Z","content":"What would you do if you had the chance to reconnect with a childhood sweetheart, even if you were already in love with someone else?\r\nA first-time film director has taken that story idea and made an… [+6318 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"The Dune Lego Set Is Amazing and Its Director and Star Approve","description":"Denis Villeneuve got deadly serious when io9 mentioned the Dune Lego set to him. “I’ll be honest with you,” the director of Dune: Part Two said. “Probably I’m making movies because first I was a hardcore Lego player. I’m from that first generation where it wa…","url":"https://gizmodo.com/lego-dune-set-denis-villeneuve-baron-stellan-skarsgard-1851226536","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/a5cdb58ab46d2c2664eb7e723550bf6b.jpg","publishedAt":"2024-02-06T17:30:00Z","content":"Denis Villeneuve got deadly serious when io9 mentioned the Dune Lego set to him. Ill be honest with you, the director of Dune: Part Two said. Probably Im making movies because first I was a hardcore … [+1659 chars]"},{"source":{"id":"engadget","name":"Engadget"},"author":"Sarah Fielding","title":"Nintendo believes it’ll sell more Switch consoles than first thought","description":"At almost seven years old, the Nintendo Switch still has life left in it — so much so that Nintendo has upped its predicted sales figures for its current fiscal year. In its third-quarter earnings release, the company announced that it was increasing Switch's…","url":"https://www.engadget.com/nintendo-believes-itll-sell-more-switch-consoles-than-first-thought-095017928.html","urlToImage":"https://s.yimg.com/ny/api/res/1.2/q7DRZqjVJBajYzvRpcX_jw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-06/be2a8a20-152b-11ee-bf27-53892d751f49","publishedAt":"2024-02-06T09:50:17Z","content":"At almost seven years old, the Nintendo Switch still has life left in it so much so that Nintendo has upped its predicted sales figures for its current fiscal year. In its third-quarter earnings rele… [+1639 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"jguerrasio@insider.com (Jason Guerrasio)","title":"'Lift' director breaks down how they pulled off the 2 airplane fight sequences, with Kevin Hart doing most of his own stunts","description":"Director F. Gary Gray broke down the fight scenes at the end of his Netflix movie, \"Lift.\"","url":"https://www.businessinsider.com/lift-director-airplane-fight-scenes-kevin-hart-2024-1","urlToImage":"https://i.insider.com/65a0251d6979d73718228362?width=1200&format=jpeg","publishedAt":"2024-01-14T12:44:01Z","content":"Though director F. Gary Gray (\"The Italian Job,\" \"The Fate of the Furious\") is no stranger to elaborate action sequences, he admits he still felt anxious developing his latest project, the Netflix he… [+4064 chars]"},{"source":{"id":null,"name":"Kotaku"},"author":"Ian Spelling","title":"The 12 Best Free Movie Streaming Services That Aren't YouTube","description":"Sure, there are plenty of great free movies on YouTube—but while YouTube is awesome, it’s not the only game in town. So we decided to put together a list of other sites that also offer free movies, break down the pros and cons of each one, briefly explore wha…","url":"https://kotaku.com/best-free-movie-streaming-sites-pluto-tubi-1851230691","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/aad2bc0faca28ded4e3a50fa0d297426.jpg","publishedAt":"2024-02-06T18:45:00Z","content":"Sony purchased Crackle in 2016, so it should surprise no one that Sony and Columbia dominate the options. But theyve also got numerous TV shows, comedy specials, documentaries, and some original prog… [+530 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Neon's Longlegs Marketing Keeps Getting Creepier","description":"A new year means new movies to watch in theaters or at home. And while we’ve got an idea of the bigger franchise tentpoles, some films are building up their presence the old-fashioned way: with some pretty effective marketing that sells you on the movie’s vib…","url":"https://gizmodo.com/longlegs-nicolas-cage-neon-teasers-1851183814","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/5f7bd8c088eb17e88504b01ec1ab6a59.jpg","publishedAt":"2024-01-21T21:15:00Z","content":"A new year means new movies to watch in theaters or at home. And while weve got an idea of the bigger franchise tentpoles, some films are building up their presence the old-fashioned way: with some p… [+1732 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Sabina Graves","title":"Diablo Cody and Zelda Williams Bonded Over Teen Rage for Lisa Frankenstein","description":"Teen romance isn’t dead anymore in Zelda Williams’ Lisa Frankenstein, the first-time feature filmmaker’s dark horror comedy. Written by Diablo Cody, it stars Kathryn Newton (Freaky) as a high schooler who spends her time hanging with the dead in a local cemet…","url":"https://gizmodo.com/lisa-frankenstein-interview-diablo-cody-zelda-williams-1851227673","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d96204450be52b098af79e114292da9d.jpg","publishedAt":"2024-02-06T21:30:00Z","content":"Teen romance isnt dead anymore in Zelda Williams Lisa Frankenstein, the first-time feature filmmakers dark horror comedy. Written by Diablo Cody, it stars Kathryn Newton (Freaky) as a high schooler w… [+2149 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Pete Volk","title":"Where to watch every Oscar-nominated movie","description":"Where to watch all the Oscar-nominated movies on streaming, including Oppenheimer, Barbie, and more on Netflix, Max, Disney Plus, and other streaming services.","url":"https://www.polygon.com/2024/1/23/24042919/oscar-movies-2024-netflix-where-to-watch-stream-amazon-max","urlToImage":"https://cdn.vox-cdn.com/thumbor/sDqVEMN4LMqDQXNuiv5ObQq8bjg=/0x52:3978x2135/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24796810/oppenheimer_review.jpg","publishedAt":"2024-01-23T15:30:00Z","content":"Academy Awards season is back, Polygon readers!\r\n2023 was a great year in movies, and now its time for a big celebration in their honor.\r\nThe Oscar nominations are officially out (it was a big day fo… [+8006 chars]"},{"source":{"id":null,"name":"Hackaday"},"author":"Al Williams","title":"Predicting the A-Bomb: The Cartmill Affair","description":"There’s an upcoming movie, Argyle, about an author whose spy novels are a little too accurate, and she becomes a target of a real-life spy game. We haven’t seen the movie, but it made u…","url":"https://hackaday.com/2024/01/18/predicting-the-a-bomb-the-cartmill-affair/","urlToImage":"https://hackaday.com/wp-content/uploads/2024/01/Predicting.jpg","publishedAt":"2024-01-18T15:00:05Z","content":"The cover of the infamous issue of Astounding, March 1944\r\nThere’s an upcoming movie, Argyle, about an author whose spy novels are a little too accurate, and she becomes a target of a real-life spy g… [+7227 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Peter Kafka","title":"Why did the powerful head of Netflix's movie studio just leave?","description":"It would be surprising if Netflix's Scott Stuber simply grew tired of holding one of the most powerful jobs in entertainment.","url":"https://www.businessinsider.com/netflix-movie-studio-chief-scott-stuber-just-left-why-2024-1","urlToImage":"https://i.insider.com/65aef6cfdcdb354a985a04c1?width=1200&format=jpeg","publishedAt":"2024-01-22T23:29:07Z","content":"Scott Stuber, right, ran Netflix's movie group, which made him the kind of guy who spent time with the likes of Brad Pitt.Jason Kempin/Getty Images for Netflix\r\nIf you don't work in Hollywood, you ma… [+4033 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Peter Kafka","title":"Did Netflix's movie boss leave because he didn't want to make so many movies?","description":"Netflix and Scott Stuber haven't said why he's leaving as film chief. But two new reports suggest one reason: He was sick of making so many movies.","url":"https://www.businessinsider.com/netflix-movie-film-boss-scott-stuber-leaving-reason-why-2024-1","urlToImage":"https://i.insider.com/65b41cfd6c8f0a134f7a573a?width=1200&format=jpeg","publishedAt":"2024-01-26T21:10:59Z","content":"Scott Stuber (middle) might be leaving Netflix because he was sick of making so many movies. He's seen with Netflix co-CEO Ted Sarandos (left) and Ashton Kutcher.Charley Gallay/Getty Images\r\n<ul><li>… [+2977 chars]"},{"source":{"id":null,"name":"NPR"},"author":"The Associated Press","title":"Carl Weathers, linebacker-turned-actor who starred in 'Rocky' movies, dies at 76","description":"Carl Weathers, a former NFL linebacker who became a Hollywood action movie and comedy star, playing nemesis-turned-ally Apollo Creed in the \"Rocky\" movies, has died.","url":"https://www.npr.org/2024/02/02/1228748907/carl-weathers-rocky-movies-mandalorian-dies","urlToImage":"https://media.npr.org/assets/img/2024/02/02/ap24033702326326_wide-590eb42fcf4bd0cf1cab4be95fa413ee7e07136d-s1400-c100.jpg","publishedAt":"2024-02-02T21:22:42Z","content":"Carl Weathers arrives at a screening for the season three premiere of The Mandalorian on Feb. 28, 2023, in Los Angeles. Weathers, a former NFL linebacker who became a Hollywood action movie and comed… [+5628 chars]"},{"source":{"id":null,"name":"NPR"},"author":"Scott Detrow","title":"They crashed in the mountains and turned to cannibalism. He focuses on the humanity","description":"Director J. A. Bayona's new movie Society of the Snow is based on the true story of the survivors of the 1972 Uruguayan plane crash in the Andes.","url":"https://www.npr.org/2024/01/10/1223078048/society-of-the-snow-ja-bayona-1972-plane-crash-cannibalism","urlToImage":"https://media.npr.org/assets/img/2024/01/05/lsdln_09042022_quimvives_v__8056_wide-b2ba2bcde9f470cf9154eec759b6e181c7c28ca4-s1400-c100.jpg","publishedAt":"2024-01-10T10:00:50Z","content":"Society of Snow is the latest to tackle the true story.\r\nCourtesy of Netflix\r\nIn October 1972, a plane carrying members of a rugby team from Uruguay, among others, crashed in the Andes. \r\nA group of … [+6514 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"Joshua Zitser","title":"Passengers found a live snake in an overhead bin like a real-life 'Snakes on a Plane'","description":"A snake sighting aboard an AirAsia Thailand flight caused panic among passengers, with some likening it to the 2006 movie \"Snakes on a Plane.\"","url":"https://www.businessinsider.com/snakes-on-plane-live-reptile-found-overhead-luggage-bin-passengers-2024-1","urlToImage":"https://i.insider.com/65a7bf0a6979d7371823d8a2?width=1200&format=jpeg","publishedAt":"2024-01-17T13:09:36Z","content":"Screenshots of a TikTok video purportedly showing an AirAsia cabin crew member trying to catch a snake on a flight from Bangkok to Phuket.UtusanTV/TikTok\r\n<ul><li>Passengers on an AirAsia Thailand fl… [+2196 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"David Pierce","title":"’Tis the season for AI apps and AI gadgets","description":"Plus, True Detective is back, the new Ballie is here, Hey has a new calendar, CES 2024 is over, and much more in this week’s Installer newsletter.","url":"https://www.theverge.com/2024/1/14/24036403/rabbit-r1-gpt-store-true-detective-ballie-ces-2024-installer-newsletter","urlToImage":"https://cdn.vox-cdn.com/thumbor/GoOUX3JUoANyHVgoAg6W0i_-DdM=/0x0:3000x2000/1200x628/filters:focal(1500x1000:1501x1001)/cdn.vox-cdn.com/uploads/chorus_asset/file/24844605/Installer_Site_Post_001.jpg","publishedAt":"2024-01-14T13:00:00Z","content":"Tis the season for AI apps and AI gadgets\r\nTis the season for AI apps and AI gadgets\r\n / Plus, in this weeks Installer: True Detective is back, the new Ballie is here, Hey has a new calendar, and muc… [+13778 chars]"},{"source":{"id":"time","name":"Time"},"author":"Moises Mendez II","title":"Here’s How the New Mean Girls Movie Stacks Up to the Original","description":"For fans of the original Mean Girls movie, the directors of the new movie break down what they decide to cut and what to keep.","url":"https://time.com/6555029/mean-girls-differences-from-original/","urlToImage":"https://api.time.com/wp-content/uploads/2024/01/MG_JW_0310_04453R2_C.jpg?quality=85","publishedAt":"2024-01-12T18:11:29Z","content":"Warning: This post contains spoilers for the new Mean Girls movie\r\nDirectors Arturo Perez Jr. and Samantha Jayne knew they were taking on a colossal task by remaking Mean Girls: Not only were they wo… [+7542 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Cheryl Eddy","title":"The Year Ahead in Horror Movies","description":"Cheryl Eddy is a senior writer for io9 as well as its news editor. You can follow her coverage here and email tips to cheryl.eddy@gizmodo.com.Read more...","url":"https://gizmodo.com/2024-year-ahead-in-horror-movies-remakes-sequels-galore-1851124286","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d3fb319d4650ef72ab0681bc3ee23091.jpg","publishedAt":"2024-01-08T18:15:00Z","content":"Announced in early 2023 soon after Knock at the Cabin hit theaters, M. Night Shyamalans next horror film will be his first release under his new deal with Warner Bros. Its plot is, well... predictabl… [+956 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Jay Peters","title":"Plex is about to launch a store for movies and TV shows","description":"Plex is going to launch a store for to buy and rent movies and TV shows in early February, executives told Lowpass. There are some other big changes set for Plex this year, too.","url":"https://www.theverge.com/2024/1/18/24043706/plex-store-movies-tv-shows","urlToImage":"https://cdn.vox-cdn.com/thumbor/gOYuc5g3kwzKEDz11TjiKD6YFzw=/0x0:2048x1152/1200x628/filters:focal(1285x569:1286x570)/cdn.vox-cdn.com/uploads/chorus_asset/file/24759174/hero_about_living_room.png","publishedAt":"2024-01-19T01:36:43Z","content":"Plex is about to launch a store for movies and TV shows\r\nPlex is about to launch a store for movies and TV shows\r\n / Youll apparently be able to rent and buy movies and TV shows in early February.\r\nB… [+1798 chars]"},{"source":{"id":null,"name":"Kotaku"},"author":"Kenneth Shepard","title":"Sonic Fans Are Stoked To Probably Watch A Child Die In The New Movie","description":"Sonic the Hedgehog 3, the third movie in the live-action adaptations, recently announced a slew of casting updates from confirming Jim Carrey’s return as villain Dr. Robotnik, to Jessica Jones star Krysten Ritter joining the cast. I simply cannot die before s…","url":"https://kotaku.com/sonic-the-hedgehog-3-movie-shadow-maria-death-actor-1851227374","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f5ece1b59f3ab7ec8bd5f6c5f553872e.jpg","publishedAt":"2024-02-05T21:30:00Z","content":"Sonic the Hedgehog 3, the third movie in the live-action adaptations, recently announced a slew of casting updates from confirming Jim Carreys return as villain Dr. Robotnik, to Jessica Jones star Kr… [+3112 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"Super7's Awesome Godzilla Minus One Figure Is Getting a Black and White Version, Too","description":"The world was already a pretty excellent place for Godzilla fans considering a) Godzilla Minus One exists and is in theaters, and b) its black and white version, Godzilla Minus One/Minus Color, is also in now in theaters for a limited time. One thing could ma…","url":"https://gizmodo.com/godzilla-minus-one-figure-black-white-toho-super7-kaiju-1851199202","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/cfa9cf6db7dc561633c605eea20d1ead.jpg","publishedAt":"2024-01-26T18:00:00Z","content":"The world was already a pretty excellent place for Godzilla fans considering a) Godzilla Minus One exists and is in theaters, and b) its black and white version, Godzilla Minus One/Minus Color, is al… [+1525 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"Marvel Is Doing a Mega Infinity Saga Live Concert Event","description":"Fans of Marvel Studios better start looking at flights because a can’t-miss mega event is coming to life this August: “Marvel Studios’ Infinity Saga Concert Experience” at the Hollywood Bowl in Los Angeles, CA. It’s a night of music celebrating the saga—spann…","url":"https://gizmodo.com/marvel-studios-infinity-saga-concert-hollywood-avengers-1851231068","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/8f4e09d240ae442cea798efe32404e4f.jpg","publishedAt":"2024-02-06T20:30:00Z","content":"Fans of Marvel Studios better start looking at flights because a cant-miss mega event is coming to life this August: Marvel Studios Infinity Saga Concert Experience at the Hollywood Bowl in Los Angel… [+1465 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"James Whitbrook","title":"I Must Not Fear the Dune Part 2 Wormussy Popcorn Bucket","description":"Everything about the moviegoing experience is merchandisable, and long has been. But the rising trend of increasingly complex and elaborate collectible popcorn buckets might have finally reached the apex with Dune: Part Two, which invites you to place your ha…","url":"https://gizmodo.com/dune-2-popcorn-bucket-sandworm-holy-crap-wtf-1851200572","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/7727317e2533465aaab77ea256a52c83.png","publishedAt":"2024-01-26T17:30:00Z","content":"Everything about the moviegoing experience is merchandisable, and long has been. But the rising trend of increasingly complex and elaborate collectible popcorn buckets might have finally reached the … [+1636 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Angela Watercutter","title":"Want to Stream Without Ads? That’ll Cost You","description":"Amazon just rolled out its ad-supported plan, the latest in a string of covert streaming price hikes. The halcyon days of commercial-free content are gone.","url":"https://www.wired.com/story/amazon-prime-video-ad-free-price-hikes/","urlToImage":"https://media.wired.com/photos/65b7e4448eea8de060c99191/191:100/w_1280,c_limit/Streaming-Price-Creep-Amazon-Rings-Of-Power-Culture-RPAZ_S1_FG_01065619_Still1531_R1.jpg","publishedAt":"2024-01-29T20:20:30Z","content":"A decade ago, cord-cutters prophesied a world free of exorbitant cable bills where everyone binged The Office without intrusions from advertisers. Now, you have to pay extra to not watch commercials … [+3384 chars]"},{"source":{"id":null,"name":"Yahoo Entertainment"},"author":"Kris Holt","title":"Death Stranding is coming to select Apple devices on January 30","description":"After a relatively short delay\r\n, you'll soon be able to enter the uniquely strange world of Death Stranding on Apple devices. Hideo Kojima's walking simulator will be available on iPhone 15 Pro models\r\n and iPads and Macs\r\n with M-series chips on January 30.…","url":"https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_4a30c02a-a7cd-4c41-a722-b0adfb70f295","urlToImage":null,"publishedAt":"2024-01-23T17:35:44Z","content":"Si vous cliquez sur « Tout accepter », nos partenaires (y compris 244 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Ryan Waniata","title":"CES 2024: TVs Get Bigger, Brighter, More Transparent","description":"Super bright, 100-inch panels are all the rage, and fully transparent screens are wowing attendees as well. Here’s all the TV tech making its way into your living room this year.","url":"https://www.wired.com/story/ces-tvs-bigger-brighter-transparent/","urlToImage":"https://media.wired.com/photos/659f9e823d368cde36e78f4e/191:100/w_1280,c_limit/01.09.24_WIRED__CES_0712.jpg","publishedAt":"2024-01-11T12:00:00Z","content":"First, Samsung dazzled attendees of its First Look event with its transparent MicroLED TV, showcasing vibrant images dancing across a slab of thin, glowing glass. Samsung has been teasing MicroLED te… [+2950 chars]"},{"source":{"id":"time","name":"Time"},"author":"Stephanie Zacharek","title":"Netflix’s Kevin Hart Vehicle Lift Is Absurd—But Still Kind of Fun","description":"The new Kevin Hart heist movie is implausible and silly, but solid performances make it a decent winter diversion.","url":"https://time.com/6554986/lift-review-netflix-kevin-hart/","urlToImage":"https://api.time.com/wp-content/uploads/2024/01/Lift_n_01_12_18_23_R.jpg?quality=85","publishedAt":"2024-01-12T18:10:41Z","content":"Too cold, too hot, too bright, or too dark to go outside? Still recovering from holiday excess? A throwaway heist movieundemanding when it comes to brain power and requiring a minimal time investment… [+4908 chars]"},{"source":{"id":"time","name":"Time"},"author":"Judy Berman","title":"Netflix Romance One Day Is an Irresistible Emotional Roller Coaster","description":"The newest adaptation of David Nicholls' international bestseller is so much better than the 2011 movie. Read TIME's review.","url":"https://time.com/6691699/one-day-review-netflix/","urlToImage":"https://api.time.com/wp-content/uploads/2024/02/OD_110_Unit_00042_TRL2.jpg?quality=85","publishedAt":"2024-02-06T16:25:13Z","content":"A lot happens in the first two decades of adulthood. We learn to live on our own and pay our own bills and build our careers. We dodge or succumb to temptations, accountable first and foremost to our… [+4420 chars]"},{"source":{"id":null,"name":"Yahoo Entertainment"},"author":null,"title":"Grand jury indicts Alec Baldwin in fatal shooting of cinematographer on movie set in New Mexico","description":null,"url":"https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_711c6c58-e0e6-48c6-8718-f2cc51aff9e6","urlToImage":null,"publishedAt":"2024-01-19T19:27:01Z","content":"Si vous cliquez sur « Tout accepter », nos partenaires (y compris 244 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Ash Parrish","title":"Universal’s next big park will include werewolves, dragons, and Super Mario","description":"Universal Studios’ new Universal Epic Universe theme park in Orlando, Florida, will feature five worlds, including a Super Nintendo World and a new Harry Potter park.","url":"https://www.theverge.com/24055456/super-nintendo-world-universal-epic-universe-florida","urlToImage":"https://cdn.vox-cdn.com/thumbor/wsYewHIxsWdh0s8ZdwHVmkaN56Y=/0x0:8256x5504/1200x628/filters:focal(4128x2752:4129x2753)/cdn.vox-cdn.com/uploads/chorus_asset/file/24449315/SUPER_NINTENDO_WORLD_land_at_USH__2_.jpg","publishedAt":"2024-01-30T15:29:14Z","content":"Universals next big park will include werewolves, dragons, and Super Mario\r\nUniversals next big park will include werewolves, dragons, and Super Mario\r\n / Play with Mario, fly dragons, scream with Dr… [+2486 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"James Whitbrook","title":"DC Is Already Preparing For Its Heroes' Public Domain Era","description":"The arrival of Steamboat Willie—and with it, the first steps of Mickey Mouse himself—into the public domain at the start of 2024 has been a milestone that, in just under three weeks, already seen a bevy of horrifying riffs and a look ahead to what other stalw…","url":"https://gizmodo.com/dc-comics-public-domain-batman-superman-wonder-woman-wb-1851177451","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/b659b9d44f8c6b27d45c0a03acf50a1b.jpg","publishedAt":"2024-01-18T23:15:00Z","content":"The arrival of Steamboat Willieand with it, the first steps of Mickey Mouse himselfinto the public domain at the start of 2024 has been a milestone that, in just under three weeks, already seen a bev… [+4249 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"James Whitbrook","title":"Barbie's Oscar Snub Discourse Has Taken a Wild, Hillary Clinton-Shaped Turn","description":"Yesterday the Academy announced the nominees for the 2024 Oscars, and Barbie did very well for itself. Best Adapted Screenplay! Two original song nods! Ryan Gosling for Best Supporting Actor and America Ferrera for Best Supporting Actress! A Best Picture nomi…","url":"https://gizmodo.com/barbie-oscars-snub-gerwig-robbie-hillary-clinton-1851193294","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/bb781bbdd981abef22bd5904e233a305.jpg","publishedAt":"2024-01-24T19:00:00Z","content":"Yesterday the Academy announced the nominees for the 2024 Oscars, and Barbie did very well for itself. Best Adapted Screenplay! Two original song nods! Ryan Gosling for Best Supporting Actor and Amer… [+5109 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Tim Hardwick","title":"Apple Vision Pro Battery Supports Up to 2.5 Hours of 2D Video Playback","description":"Under cover of its Vision Pro headset launch date announcement, Apple has revealed that the external battery supports up to 2.5 hours of 2D video playback, half an hour more than it offers in \"general use\" on a single charge.\n\n\n\n\n\nApple quietly updated its pr…","url":"https://www.macrumors.com/2024/01/08/apple-vision-pro-battery-life-video-playback/","urlToImage":"https://images.macrumors.com/t/fQrpD7x27TCLeL2IemaCgRRCP8A=/1640x/article-new/2024/01/vision-pro-battery-pack.jpg","publishedAt":"2024-01-08T15:51:05Z","content":"Under cover of its Vision Pro headset launch date announcement, Apple has revealed that the external battery supports up to 2.5 hours of 2D video playback, half an hour more than it offers in \"genera… [+1296 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Sabina Graves","title":"Disney World's Massive Arts Festival Knows Its Fandom Best","description":"Walt Disney World’s best and most underrated festival is going on right now at Epcot. Disney Parks’ International Festival of the Arts happens at the start of the year and showcases amazing artists debuting Disney-inspired art—and it’s truly any fandom print …","url":"https://gizmodo.com/disney-parks-epcot-festival-arts-marvel-star-wars-pixar-1851174512","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/98925cf831a5f02e9db1c96c26bebed9.jpg","publishedAt":"2024-01-18T22:15:00Z","content":"Walt Disney Worlds best and most underrated festival is going on right now at Epcot. Disney Parks International Festival of the Arts happens at the start of the year and showcases amazing artists deb… [+1804 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Robert Downey Jr. Wishes His MCU Work Got More Real Recognition","description":"The MCU started with Robert Downey Jr.’s career-defining turn as Iron Man all the way back in 2008. Over the next 11 years, Downey would reprise the role for numerous sequels and team-ups, and now that he’s had some distance from the whole shebang, he thinks …","url":"https://gizmodo.com/robert-downey-jr-iron-man-marvel-tenure-1851166210","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/ffa9c5db4a418363c1ae31093cf6ca61.jpg","publishedAt":"2024-01-14T21:15:00Z","content":"The MCU started with Robert Downey Jr.s career-defining turn as Iron Man all the way back in 2008. Over the next 11 years, Downey would reprise the role for numerous sequels and team-ups, and now tha… [+2266 chars]"},{"source":{"id":"time","name":"Time"},"author":"Solcyre Burga","title":"The Internet Has Thoughts on Ken Getting an Oscar Nomination Over Barbie","description":"The Internet is mad that Ryan Gosling got a nomination for Barbie but Margot Robbie and Greta Gerwig didn't, for a movie about female empowerment.","url":"https://time.com/6565502/margot-robbie-ryan-gosling-greta-gerwig-barbie-oscars/","urlToImage":"https://api.time.com/wp-content/uploads/2024/01/barbie-gosling-robbie-oscars-nominations.jpg?quality=85","publishedAt":"2024-01-23T16:43:27Z","content":"Warning: This post contains spoilers for Barbie\r\nThe 2024 Oscar nominations may have proven that it is not, in fact, a Barbie world.\r\nThe Academy of Motion Picture Arts and Sciences nominated Ryan Go… [+2356 chars]"},{"source":{"id":null,"name":"Digital Trends"},"author":"Joe Allen","title":"Furiosa: A Mad Max Saga: Release date, plot, cast, trailer, and more","description":"Furiosa: A Mad Max Saga is hitting movie theaters soon. Here's everything we know about the Anya Taylor-Joy/Chris Hemsworth action movie so far.","url":"https://www.digitaltrends.com/movies/furiosa-mad-max-saga-release-date-plot-cast-trailer/","urlToImage":"https://www.digitaltrends.com/wp-content/uploads/2024/01/Furiosa-A-Mad-Max-Saga-trailer-2.jpg?resize=1200%2C630&p=1","publishedAt":"2024-01-10T19:00:29Z","content":"Oh what a lovely day! Almost a decade after George Miller stunned the film-loving world with the release of Mad Max: Fury Road, the director is back with Furiosa: A Mad Max Saga. The film, which is a… [+4328 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Austen Goslin","title":"Everyone’s wrong about Night Swim, a good horror movie and a better family tragedy","description":"Night Swim is better than reviews suggest. A great January horror movie about a haunted pool, it has some scares and a strong baseball subplot. In theaters now.","url":"https://www.polygon.com/24030612/night-swim-review-baseball-wyatt-russell-ending","urlToImage":"https://cdn.vox-cdn.com/thumbor/IQ7SwMvNHaew0s8eAgFrgFmTbYA=/0x0:1536x804/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25212686/Night_Swim_1.jpg","publishedAt":"2024-01-08T23:18:21Z","content":"January is a special time for horror fans. The holidays are over, the new year is just beginning, and the horror options at the box office are as much of a mixed bag as theyll be all year. Some years… [+6266 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Austen Goslin","title":"The Mandalorian and Grogu will star in Star Wars’ next movie","description":"Star Wars’ return to the big screen will be with its TV stars, the Mandalorian and Grogu. The movie will be directed by Jon Favreau and produced by Dave Filoni.","url":"https://www.polygon.com/24031630/star-wars-movie-mandalorian-grogu-baby-yoda-filoni-favreau","urlToImage":"https://cdn.vox-cdn.com/thumbor/241tG7Nkl5nWw76JXSRzZK66LiI=/337x0:2400x1080/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25214535/TM4__SET_MandoVShipExplosionEXT_231104_v035__RYCH.jpg","publishedAt":"2024-01-09T17:56:56Z","content":"Din Djarin and his tiny green companion are heading to the big screen. Lucasfilm announced a new Star Wars movie on Tuesday called The Mandalorian &amp; Grogu. The film is set to begin production in … [+1792 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Toussaint Egan","title":"Wonka, The Beekeeper, and every new movie to watch at home this weekend","description":"Wonka comes to VOD this week, along with David Ayer’s The Beekeeper, the streaming debut of Past Lives, and more.","url":"https://www.polygon.com/2024/2/2/24050727/new-movies-watch-wonka-netflix-orion-and-the-dark-beekeeper","urlToImage":"https://cdn.vox-cdn.com/thumbor/t0Y3LIRJeP_puhmwLkpXy0oZOGw=/522x0:4592x2131/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25160599/wonka_point.jpg","publishedAt":"2024-02-02T23:15:00Z","content":"Greetings, Polygon readers! Each week, we round up the most notable new releases to streaming and VOD, highlighting the biggest and best new movies for you to watch at home. So quiet up and listen do… [+13201 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Petrana Radulovic","title":"This song cut from the 2024 Mean Girls movie could’ve saved Cady’s arc","description":"“Stop,” the big song Damian sings at the beginning of the second act of Mean Girls, would’ve helped bolster Cady’s arc in the new Mean Girls movie musical.","url":"https://www.polygon.com/24036144/mean-girls-songs-cut-from-broadway-musical-differences","urlToImage":"https://cdn.vox-cdn.com/thumbor/4nCj7TZA5kKFRTXY8tzu-uGbBKM=/0x323:4528x2694/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25222132/MGM_JW_0323_12064R.jpg","publishedAt":"2024-01-16T19:03:00Z","content":"Like many theatrical adaptations of stage musicals, Mean Girls(2024) doesnt include all the songs from the Broadway version. After all, the musical has a two-and-a-half-hour run time, which wouldnt t… [+3886 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Austen Goslin","title":"Netflix’s Hit Man is a romantic comedy with Glen Powell in full-on movie star mode","description":"Hit Man, the new movie from Glen Powell and Richard Linklater, has its first full trailer complete with assassin jokes and romcom tension. It comes out June 7","url":"https://www.polygon.com/24046802/hit-man-netflix-trailer-glen-powell-comedy","urlToImage":"https://cdn.vox-cdn.com/thumbor/YgC-KFN9c_6rCVbK85h0m_-DeCo=/0x0:2480x1298/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25174406/HIT_MAN_004.jpg","publishedAt":"2024-01-22T16:02:39Z","content":"Image: Netflix\r\n\n \n\n The new trailer for Netflix’s new movie is full of hidden identity hijinks \n \n Continue reading…"},{"source":{"id":"polygon","name":"Polygon"},"author":"Pete Volk","title":"How Mayhem! crafted one of the best elevator fight scenes in action movie history","description":"The new action movie Mayhem! has one of the best elevator fight scenes ever. We talked to the director, star, and action choreographer about how they did it.","url":"https://www.polygon.com/24029877/mayhem-elevator-fight-scene-watch-interview-xavier-gens-jude-poyer-nassim-lyes-farang","urlToImage":"https://cdn.vox-cdn.com/thumbor/MhcCGrJWK78Qhjlhqj-hZjvNnAA=/167x0:1697x801/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25213994/mayhemelevatorfight1.jpg","publishedAt":"2024-01-10T14:00:00Z","content":"2024 started off with a bang for action fans with the release of Mayhem!, the excellent new revenge thriller from some of the people behind Gangs of London. The movie isnt just an action slugfest it … [+5390 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Matt Patches","title":"Tom Cruise is still the movie industry’s best hope for survival, apparently","description":"Top Gun: Maverick’s success put Cruise in a position to make tons of new movies, including a movie shot in space.","url":"https://www.polygon.com/24035747/top-gun-3-new-tom-cruise-movies","urlToImage":"https://cdn.vox-cdn.com/thumbor/VDcD5hEc-bU6tUgHHMWaTjCR98Y=/147x0:1291x599/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23352572/maerick_top_gun_cruise.jpg","publishedAt":"2024-01-12T17:19:52Z","content":"The combined power of Barbie and Oppenheimer renewed the movie industry with a kind of zeitgeisty excitement for big-screen entertainment that was so palpable it was... a little scary. Barbenheimer f… [+5315 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Toussaint Egan","title":"Killers of the Flower Moon, Napoleon, and every new movie to watch at home this weekend","description":"Killers of the Flower Moon starring Leonardo DiCaprio and Robert De Niro comes to Apple TV Plus this week, along with the VOD debut of Napoleon, He Went That Way, and more.","url":"https://www.polygon.com/2024/1/12/24023012/new-movies-watch-killers-of-the-flower-moon-apple-tv-lift-netflix-napoleon","urlToImage":"https://cdn.vox-cdn.com/thumbor/WLEgVD1oGyWykcjEsI12SxmStto=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24321563/Killers_of_the_Flower_Moon_Photo_0101.jpg","publishedAt":"2024-01-12T23:15:00Z","content":"Greetings, Polygon readers! Each week, we round up the most notable new releases to streaming and VOD, highlighting the biggest and best new movies for you to watch at home.\r\nThis week, Killers of th… [+7705 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Austen Goslin","title":"Netflix announces every new movie coming to the service in 2024","description":"Millie Bobby Brown’s Damsel, a Mark Wahlberg comedy and a Disney-style musical and more are coming to Netflix. Here’s every movie coming to Netflix in 2024.","url":"https://www.polygon.com/24058003/new-netflix-movies-2024-releases","urlToImage":"https://cdn.vox-cdn.com/thumbor/HLHeIyWM2BOcwAFR8vpb7cSKqRs=/0x0:9000x4712/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25261042/Damsel.jpg","publishedAt":"2024-02-01T15:59:35Z","content":"Photo: John Wilson/Netflix\r\n\n \n\n Netflix has everything from rom coms to action movies this year\n \n Continue reading…"},{"source":{"id":"polygon","name":"Polygon"},"author":"Petrana Radulovic","title":"Charlie Kaufman’s animated Netflix movie Orion and the Dark is a deeply weird gem","description":"Eternal Sunshine of the Spotless Mind and Being John Malkovich writer Charlie Kaufman brings existentialism to a DreamWorks movie. Streaming on Netflix now.","url":"https://www.polygon.com/24058107/orion-and-the-dark-charlie-kaufman-dreamworks-movie-review-netflix","urlToImage":"https://cdn.vox-cdn.com/thumbor/xE4kMMwXgU92W-xvCUypJlrcohU=/165x0:4291x2160/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25261157/Orion_and_the_Dark_u_00_18_31_22.jpg","publishedAt":"2024-02-02T16:02:00Z","content":"If you buy something from a Polygon link, Vox Media may earn a commission. See our ethics statement.At first glance, Netflix and DreamWorks new kids movie Orion and the Dark seems like standard anima… [+4451 chars]"},{"source":{"id":null,"name":"HuffPost"},"author":"Caroline Bologna","title":"This New Heist Comedy Is The Top Movie On Netflix Right Now","description":"A true-crime documentary and an awards season darling are also trending on streaming services like Max, Apple TV+, Hulu and Amazon Prime Video.","url":"https://www.huffpost.com/entry/lift-popular-netflix-shows_l_65a5f08ce4b07bd6950ddd32","urlToImage":"https://img.huffingtonpost.com/asset/65a6edcd240000750027f587.jpg?ops=1200_630","publishedAt":"2024-01-16T21:11:52Z","content":"Lift is currently the most popular movie on Netflix, according to the streaming services public ranking system.\r\nAfter its initial August 2023 release date was postponed due to the SAG-AFTRA strike, … [+4554 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Pete Volk","title":"The Beekeeper compels you to join Jason Statham’s hive","description":"Jason Statham’s new action movie, directed by David Ayer, is a fun, silly time, with great fight scenes and funny bee jokes. In theaters Jan. 12.","url":"https://www.polygon.com/reviews/24031441/beekeeper-review-jason-statham-movie","urlToImage":"https://cdn.vox-cdn.com/thumbor/Rq0ebF8ShVnjMiDE_BBTWgRe2FU=/0x0:5000x2618/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25214116/the_beekeeper_BK_08183_RC_rgb.jpg","publishedAt":"2024-01-10T19:00:00Z","content":"A January Jason Statham action movie titled The Beekeeper comes with the weight of expectations. Beekeeper must have a double meaning. The movie must be littered with tongue-in-cheek bee puns and ref… [+6171 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Austen Goslin","title":"Zone of Interest’s incredible sound design got a special mix for home viewing","description":"The Zone of Interest’s Academy Award-nominated sound design is an incredible part of the movie. Designer Johnnie Burn made sure that’s true at home or in theaters.","url":"https://www.polygon.com/24055667/zone-of-interest-sound-design-interview-oscar-home-release","urlToImage":"https://cdn.vox-cdn.com/thumbor/_OCK_y3sylVjlYnsOQF4IMLkZCI=/0x0:3139x1643/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24866265/TZOI_HEDWIG.jpg","publishedAt":"2024-02-02T18:02:00Z","content":"The Zone of Interest is one of the most harrowing and memorable movies released in the last year. It presents a unique perspective on the Holocaust, telling one story with its visuals while revealing… [+4498 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Juli Clover","title":"Over 150 3D Movies and Spatial Games Coming to Apple Vision Pro","description":"At launch, the Apple TV app will have more than 150 3D movie and TV show options for Apple Vision Pro users to watch, Apple said today when it announced the Vision Pro launch date.\n\n\n\n\n\nWhile the Vision Pro will work with any TV show or movie available throug…","url":"https://www.macrumors.com/2024/01/08/vision-pro-movies-games/","urlToImage":"https://images.macrumors.com/t/c18QxiNu_hUd_4XbDWjrWqKcI58=/2000x/article-new/2023/06/apple-vision-pro-movie-experience.jpg","publishedAt":"2024-01-09T00:17:17Z","content":"At launch, the Apple TV app will have more than 150 3D movie and TV show options for Apple Vision Pro users to watch, Apple said today when it announced the Vision Pro launch date.\r\nWhile the Vision … [+1281 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Oli Welsh","title":"How to watch Killers of the Flower Moon in two (or more) parts","description":"Martin Scorsese’s true-crime movie, starring Leonardo DiCaprio, is now streaming — here are the best places to break it into two, three, or four parts.","url":"https://www.polygon.com/24034190/killers-of-the-flower-moon-streaming-apple-tv-plus-break-points","urlToImage":"https://cdn.vox-cdn.com/thumbor/Mmce0MOV1tgp6OZIyxx6SdcWwO8=/0x0:3067x1606/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25216793/Killers_of_the_Flower_Moon_Photo_0118.jpg","publishedAt":"2024-01-12T14:01:00Z","content":"Martin Scorseses compelling, righteously furious crime epic Killers of the Flower Moon is now available to stream at home on Apple TV Plus, and its well worth watching if you didnt catch it in theate… [+6437 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Jordan Maison","title":"For a Native viewer, one moment in Killers of the Flower Moon stands out above the rest","description":"Martin Scorsese’s movie about the Osage murders gets personal for a Ponca writer whose family was close to the real historical events. Now streaming on Apple TV Plus.","url":"https://www.polygon.com/24036123/killers-of-the-flower-moon-native-american-osage-viewing","urlToImage":"https://cdn.vox-cdn.com/thumbor/XZUJUaU81YCT9RwSPcuzio7pqYc=/0x0:2600x1361/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25222130/MCDKIOF_PA028.jpg","publishedAt":"2024-01-16T16:02:00Z","content":"If you buy something from a Polygon link, Vox Media may earn a commission. See our ethics statement.Theres a small moment in Martin Scorseses Killers of the Flower Moon that fundamentally changed the… [+10466 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Toussaint Egan","title":"The best sci-fi movies to watch on Netflix this January","description":"Looking for the best sci-fi movie to watch on Netflix this January? You’ve got options, but here are three picks that fit the winter vibe.","url":"https://www.polygon.com/what-to-watch/2024/1/20/24040599/best-sci-fi-movies-watch-netflix-january-2024","urlToImage":"https://cdn.vox-cdn.com/thumbor/v9_A_TrEsbh4J7YPGkgIEP1qaE8=/128x0:1152x536/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25230209/29__433_.jpg","publishedAt":"2024-01-20T14:00:00Z","content":"Greetings, Polygon readers!\r\nThis month marks a brave new year, with an exciting new slate of sci-fi releases on the frontier. Dune: Part Two, Furiosa: A Mad Max Saga, and Mickey 17 are all primed to… [+4354 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Petrana Radulovic","title":"Netflix’s Orion and the Dark brought back techniques animators aren’t using anymore","description":"Charlie Kaufman’s animated movie Orion and the Dark continues the trend of stylized CG movies like Into the Spider-Verse and The Bad Guys. On Netflix Feb. 2.","url":"https://www.polygon.com/24056855/orion-and-the-dark-dreamworks-2d-animation-netflix","urlToImage":"https://cdn.vox-cdn.com/thumbor/ot3UcOqgB7jFsJJ2bTZsVHvZNiU=/0x0:1559x816/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25258737/Orion_with_phone.jpg","publishedAt":"2024-02-01T15:01:00Z","content":"Like many animated movies in the last couple of years, Netflix and DreamWorks Orion and the Dark steps outside the design conventions that had come to define American CG movies. The stylistic revolut… [+3442 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Toussaint Egan","title":"The best thrillers to watch on Netflix this January","description":"Looking for a great movie to watch this January? Look no further than these thrillers, some of the best movies on Netflix, including The Equalizer 3 and Oldboy.","url":"https://www.polygon.com/what-to-watch/2024/1/13/24034487/best-thriller-movies-netflix-watch-january-2024","urlToImage":"https://cdn.vox-cdn.com/thumbor/pFiZr7v7Jy9ayuXbcpQM_MtDQtI=/0x107:1486x885/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/24977461/equalizer_3.jpg","publishedAt":"2024-01-13T14:00:00Z","content":"Greetings, Polygon readers!\r\nIts a whole new year, brimming with possibilities and exciting new releases on the near horizon. Naturally, that means theres also a whole new batch of thrillers to watch… [+4063 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Susana Polo","title":"Netflix’s Avatar: The Last Airbender has cleared at least one (low) bar","description":"Netflix’s new live action Avatar: The Last Airbender TV show has one thing over M. Night Shyamalan’s live action movie: Appa the sky bison.","url":"https://www.polygon.com/24048055/avatar-last-airbender-netflix-live-action-appa","urlToImage":"https://cdn.vox-cdn.com/thumbor/fXqnd7AfuRugt3nc9HPG2cptqPY=/338x0:2825x1302/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25243996/Screen_Shot_2024_01_23_at_12.15.12_PM.png","publishedAt":"2024-01-23T18:30:00Z","content":"Avatar: The Last Airbender fans have every reason to be skeptical of Netflixs new show. Even if they hadnt been legendarily burned by a live-action production before, theres the departure of the orig… [+1575 chars]"},{"source":{"id":null,"name":"Boing Boing"},"author":"Lee Keeler","title":"\"Charley Varrick\"— like a Steve McQueen movie but with a grumpy high school principal starring in his own fantasy","description":"Heed the digital sea change, my friends, as we watch the DVD shelves of Best Buy recede into the ether. We're running out of chances to scrutinize a movie in our hands, from scanning the blurbs on the back to gawking at the cover art. — Read the rest \nThe pos…","url":"https://boingboing.net/2024/01/11/charley-varrick-like-a-steve-mcqueen-movie-but-with-a-grumpy-high-school-principal-starring-in-his-own-fantasy.html","urlToImage":"https://boingboing.net/wp-content/uploads/2024/01/Header-Image-Charley-Varrick.jpg","publishedAt":"2024-01-11T22:48:31Z","content":"Heed the digital sea change, my friends, as we watch the DVD shelves of Best Buy recede into the ether. We're running out of chances to scrutinize a movie in our hands, from scanning the blurbs on th… [+3332 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Justin Carter","title":"Fear Street's Next Movie is Going to Prom","description":"Image: Netflix\r\nIf you were someone who liked Netflix’s Fear Street trilogy of movies in 2021, good news: R.L. Stine says another film is on the way. On Twitter, Stine revealed a new installment was set to start production pretty soon. This new movie will be …","url":"https://gizmodo.com/fear-street-new-movie-prom-queen-netflix-1851166068","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e5b8c57fea2eefc9b0672f2227a22aec.jpg","publishedAt":"2024-01-14T20:35:00Z","content":"If you were someone who liked Netflixs Fear Street trilogy of movies in 2021, good news: R.L. Stine says another film is on the way. \r\nOn Twitter, Stine revealed a new installment was set to start pr… [+1474 chars]"},{"source":{"id":"espn","name":"ESPN"},"author":"Anthony Gharib","title":"'Titanic,' Tom Brady on the bench and more trends from Michigan's last national title","description":"The blockbuster movie \"Titanic\" was in the midst of an epic run the last time the Michigan Wolverines were national champions.","url":"https://www.espn.com/college-football/story/_/id/39256158/michigan-wolverines-2023-last-national-title","urlToImage":"https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0109%2Fr1274992_1296x729_16%2D9.jpg","publishedAt":"2024-01-09T04:31:05Z","content":"The No. 1 Michigan Wolverines defeated the No. 2 Washington Huskies34-13 to win their first College Football Playoff National Championship and outright national title since 1948 (the Wolverines split… [+3470 chars]"},{"source":{"id":null,"name":"Slate Magazine"},"author":"Nadira Goffe","title":"No, Taylor Swift Didn’t Secretly Write This Spy Movie. The Real Twists Are Much Sillier.","description":"Who is Agent Argylle? What happens to the cat? What’s Taylor Swift got to do with it? And other urgent questions, answered.","url":"https://slate.com/culture/2024/02/argylle-movie-taylor-swift-dua-lipa-kingsman-twists-explained-elly-conway.html","urlToImage":"https://compote.slate.com/images/20f0009b-b74d-4648-90a4-cb7e163f18b2.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560","publishedAt":"2024-02-06T19:48:46Z","content":"This post contains spoilers for the film Argylle.\r\nArgylle, the new big-budget spy action comedy from Kingsman co-creator Matthew Vaughn, may have faltered at the box office, but it has viewers buzzi… [+10137 chars]"},{"source":{"id":null,"name":"Ctrl-alt-test.fr"},"author":"LLB","title":"How we made an animated movie in 8kB","description":"The Sheep and the Flower - a demoscene production and real-time animation that looks like a standard short animated movie, in just 8kB","url":"https://www.ctrl-alt-test.fr/2024/how-we-made-an-animated-movie-in-8kb/","urlToImage":"https://www.ctrl-alt-test.fr/wp-content/uploads/2023/04/image-1.png","publishedAt":"2024-01-24T18:46:07Z","content":"In November 2022, we set ourselves a challenge: make a real-time animation that looks like a standard short animated movie, with the constraint that it should fit in 8 kilobytes. The goal was to have… [+21229 chars]"},{"source":{"id":null,"name":"Yahoo Entertainment"},"author":"Richard Lai","title":"Minecraft x Planet Earth III is the least offensive corpo collab of the year","description":"If you own a copy of Minecraft: Bedrock Edition or Minecraft: Education Edition, you can now grab a free expansion pack based on the BBC's Planet Earth III. Much like the previous Frozen Planet II experience, this new wildlife documentary DLC lets players exp…","url":"https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_eb09caf5-b401-43db-8bed-941691eddce1","urlToImage":null,"publishedAt":"2024-01-17T04:04:38Z","content":"Si vous cliquez sur « Tout accepter », nos partenaires (y compris 244 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"},{"source":{"id":null,"name":"Kotaku"},"author":"Cheryl Eddy","title":"10 Twisty Sci-Fi Movies On Amazon Prime To Watch Over And Over","description":"There are lots of reasons to re-watch movies—the obvious being you love them so much, you just want to enjoy them again. There are also situations where a movie has so much going on, or whips out a big third-act reveal that upends all of act one, that you jus…","url":"https://kotaku.com/amazon-prime-best-scifi-movies-1851207145","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f86a76245527a37d9d441d4d7eb95862.jpg","publishedAt":"2024-01-30T15:00:00Z","content":"There are lots of reasons to re-watch moviesthe obvious being you love them so much, you just want to enjoy them again. There are also situations where a movie has so much going on, or whips out a bi… [+277 chars]"},{"source":{"id":null,"name":"Yahoo Entertainment"},"author":"Lawrence Bonk","title":"Netflix's full Avatar: The Last Airbender trailer nails the vibe of the cartoon","description":"Hold onto your cabbages. Netflix just dropped a full trailer for its forthcoming live-action adaptation of Avatar: The Last Airbender. It actually looks pretty cool, surprising fans who have been dreading a repeat of the disastrous 2010 film adaptation. The v…","url":"https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_02db1b23-8098-4ee4-a978-780f95038de9","urlToImage":null,"publishedAt":"2024-01-23T19:55:39Z","content":"Si vous cliquez sur « Tout accepter », nos partenaires (y compris 244 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"},{"source":{"id":null,"name":"Yahoo Entertainment"},"author":"Kris Holt","title":"Hideo Kojima teases a new action-espionage game for PlayStation","description":"Hideo Kojima is a busy, busy man. Not only does he have Death Stranding 2, a movie based on the first game and Xbox horror title OD on his plate, he's developing a brand new game for PlayStation. He'll be going back to his roots, as it's an action-espionage t…","url":"https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_5b33229e-6793-497c-a168-72f1f9e251e7","urlToImage":null,"publishedAt":"2024-01-31T23:08:46Z","content":"Si vous cliquez sur « Tout accepter », nos partenaires (y compris 244 qui font partie du Cadre de transparence et de consentement dIAB) et nous utiliserons également des témoins et vos données person… [+982 chars]"},{"source":{"id":null,"name":"Kotaku"},"author":"Levi Winslow","title":"Star Wars Fans Weigh In On The Mandalorian And Grogu","description":"Earlier this month, we asked you, dear readers, what you wanted to see in the newly announced The Mandalorian and Grogu movie based on the Disney+ series created by Jon Favreau. The answers were pretty varied, but we discovered two commonalities across most r…","url":"https://kotaku.com/kotaku-asks-star-wars-mandalorian-grogu-movie-1851172758","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/451151438080202b9c2899e1d400b33d.jpg","publishedAt":"2024-01-17T17:15:00Z","content":"Earlier this month, we asked you, dear readers, what you wanted to see in the newly announced The Mandalorian and Grogu movie based on the Disney+ series created by Jon Favreau. The answers were pret… [+876 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Oppenheimer: Cillian Murphy film marches towards Oscars success","description":"Christopher Nolan's film got another boost in its awards campaign at last week's Golden Globes.","url":"https://www.bbc.co.uk/news/entertainment-arts-67950097","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/151BA/production/_132285468_crr2_0017_oppen_5p_timed_ip_r02a_bt1886.0182806.jpg","publishedAt":"2024-01-14T02:42:07Z","content":"When Oppenheimer star Robert Downey Jr collected his Golden Globe for best supporting actor last week, he reflected on what an unlikely success the movie had been.\r\n\"A sweeping story about the ethica… [+8359 chars]"},{"source":{"id":"wired","name":"Wired"},"author":"Ryan Waniata","title":"7 Best TV Deals to Catch Up on Oscar-Nominated Films (or the Super Bowl)","description":"If you're hunting for a new screen to watch the game—or catch up on Oscar-nominated movies before the awards show—we've rounded up some excellent TV deals.","url":"https://www.wired.com/story/tv-deals-january-2024/","urlToImage":"https://media.wired.com/photos/649f1b4fe416fd283a85c45b/191:100/w_1280,c_limit/Samsung-S95C-Review-tOP-Gear.jpg","publishedAt":"2024-01-23T17:12:38Z","content":"Its almost Super Bowl Sunday, which means friendly football gatherings, gagillion-dollar commercials, and, naturally, big sales on great TVs. Right now is the unofficial grace period for last-minute … [+4943 chars]"},{"source":{"id":"business-insider","name":"Business Insider"},"author":"aadekaiyero@insider.com (Ayomikun Adekaiyero)","title":"'The Color Purple' star Taraji P. Henson had to prove she could sing, and the director had to fight to cast her: 'Welcome to Hollywood'","description":"Taraji P. Henson told IndieWire she had to prove she could sing in her audition for \"The Color Purple.\" Hanson sang live at the 2006 Oscars.","url":"https://www.businessinsider.com/taraji-p-henson-the-color-purple-sing-prove-audition-2024-1","urlToImage":"https://i.insider.com/65a7aee4dcdb354a985819e3?width=1200&format=jpeg","publishedAt":"2024-01-17T12:45:21Z","content":"Taraji P. Henson said she had to prove she could sing in her audition for \"The Color Purple,\" and that the movie's director fought to cast her.In a recent interview with IndieWire, Henson said that d… [+1941 chars]"},{"source":{"id":null,"name":"Blogger.com"},"author":"Calculated Risk","title":"Update on High Frequency Indicators: Airlines and Movie Tickets","description":null,"url":"https://www.blogger.com/comment.g?blogID=10004977&postID=2486116923793519496&bpli=1","urlToImage":null,"publishedAt":"2024-01-22T16:21:00Z","content":"I stopped the weekly updates of high frequency indicators at the end of 2022. Here is an early 2024 look at two indicators:\n\n----- Airlines: Transportation Security Administration -----\r\n\n\nThe TSA is… [+1021 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Cheryl Eddy","title":"Destroy All Neighbors Is a Diabolical Good Time","description":"There are plenty of cult horror movies that have rock n’ roll as a theme, with an emphasis on heavy metal; think Trick or Treat, The Gate, and Rock ‘n’ Roll Nightmare. But far fewer pay glory to progressive rock, a genre stuffed with complicated riffs and tem…","url":"https://gizmodo.com/shudder-horror-review-destroy-all-neighbors-alex-winter-1851154117","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/93aa8301518a824313a498e7cba46307.jpg","publishedAt":"2024-01-11T20:45:00Z","content":"There are plenty of cult horror movies that have rock n roll as a theme, with an emphasis on heavy metal; think Trick or Treat, The Gate, and Rock n Roll Nightmare. But far fewer pay glory to progres… [+2839 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Oscar Gonzalez","title":"Trend of the Week: Tech Gets Horny at CES","description":"This week in trends, the biggest tech event of the year took place in Las Vegas. The Consumer Electronics Show features the latest devices such as a transparent TV, another TV that folds, and this adorable ball-shaped robot from Samsung. But even though they’…","url":"https://gizmodo.com/trend-of-the-week-tech-gets-horny-at-ces-1851164305","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/aa5e61a0bc5a1f412770693cf90f8425.jpg","publishedAt":"2024-01-15T15:23:00Z","content":"This week in trends, the biggest tech event of the year took place in Las Vegas. The Consumer Electronics Show features the latest devices such as a transparent TV, another TV that folds, and this ad… [+2450 chars]"},{"source":{"id":null,"name":"Gizmodo.com"},"author":"Germain Lussier","title":"James Cameron Is Thinking About Avatar 6 and 7","description":"Just when you thought five Avatar movies seemed like more than enough, James Cameron drops another bombshell. Speaking at the Saturn Awards, the co-writer and director of the mega sci-fi franchise revealed that while the next three films have already been wri…","url":"https://gizmodo.com/avatar-6-and-7-release-dates-james-cameron-disney-fox-1851226025","urlToImage":"https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d871f96e4c64f054639656998c30bce6.jpg","publishedAt":"2024-02-05T20:30:00Z","content":"Just when you thought five Avatar movies seemed like more than enough, James Cameron drops another bombshell. Speaking at the Saturn Awards, the co-writer and director of the mega sci-fi franchise re… [+2355 chars]"},{"source":{"id":null,"name":"Boing Boing"},"author":"Rob Beschizza","title":"Behind the Screens: what the computer code seen in movies and TV shows actually does","description":"When movies and TV shows call for computer code to be shown on-screen, sometimes the film-makers bother to make it look realistic. In doing so, fascination lurks. In Behind the Screens, John Graham-Cumming takes a gloriously in-depth look at specific examples…","url":"https://boingboing.net/2024/01/16/behind-the-screens-what-the-computer-code-seen-in-movies-and-tv-shows-actually-does.html","urlToImage":null,"publishedAt":"2024-01-16T22:59:36Z","content":"When movies and TV shows call for computer code to be shown on-screen, sometimes the film-makers bother to make it look realistic. In doing so, fascination lurks. In Behind the Screens, John Graham-C… [+782 chars]"},{"source":{"id":null,"name":"Artofmanliness.com"},"author":"Brett & Kate McKay","title":"Odds & Ends: January 12, 2024","description":"Cool Hand Luke. I re-watched Cool Hand Luke this past week, and boy, did I enjoy it. At first glance, this film seems like just another slacker anti-establishment movie, and maybe it is, but what makes this movie great are the layers of existential interpreta…","url":"https://www.artofmanliness.com/odds-ends/odds-ends-january-12-2024/","urlToImage":"https://content.artofmanliness.com/uploads/2023/01/Odds-and-Ends-no-logo-header.jpg","publishedAt":"2024-01-12T15:32:43Z","content":"Cool Hand Luke. I re-watched Cool Hand Luke this past week, and boy, did I enjoy it. At first glance, this film seems like just another slacker anti-establishment movie, and maybe it is, but what mak… [+2869 chars]"},{"source":{"id":null,"name":"MacRumors"},"author":"Juli Clover","title":"Apple Shares New 'Get Ready' Ad Ahead of Vision Pro Launch","description":"Apple today shared a new \"Get Ready\" ad promoting the upcoming launch of the Vision Pro headset. The ad features notable movie and TV show characters putting on masks, glasses, and other similar accessories.\n\n\n\n\r\n\n\nThere are scenes from Star Wars, Fantastic M…","url":"https://www.macrumors.com/2024/01/08/apple-vision-pro-get-ready-ad/","urlToImage":"https://images.macrumors.com/t/avsDcCOQ8KkoDBDufNTHYTge9Y8=/1600x/article-new/2024/01/vision-pro-get-ready.jpeg","publishedAt":"2024-01-09T01:17:59Z","content":"Apple today shared a new \"Get Ready\" ad promoting the upcoming launch of the Vision Pro headset. The ad features notable movie and TV show characters putting on masks, glasses, and other similar acce… [+455 chars]"},{"source":{"id":"the-verge","name":"The Verge"},"author":"Alex Cranz","title":"Netflix is turning into cable TV","description":"After the loss of behind-the-scenes talent and the acquisition of rights to WWE, Netflix is starting to feel more and more like basic cable.","url":"https://www.theverge.com/2024/1/23/24047817/netflix-is-turning-into-cable-tv","urlToImage":"https://cdn.vox-cdn.com/thumbor/CGqSiQD61ekSjHh1zKXgaOoaQ_E=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23923974/acastro_STK072_04.jpg","publishedAt":"2024-01-23T23:24:58Z","content":"Netflix is turning into cable TV\r\nNetflix is turning into cable TV\r\n / Its got Suits, it's got old movies, it's got WWE what more does Netflix need to be a perfectly fine cable channel?\r\nByAlex Cranz… [+5207 chars]"},{"source":{"id":null,"name":"Digital Trends"},"author":"Joe Allen","title":"Like the Kevin Hart Netflix movie Lift? Then watch these great action movies right now","description":"These three heist movies will give you the same thrills you get from Netflix's action movie Lift starring Kevin Hart.","url":"https://www.digitaltrends.com/movies/movies-like-netflix-lift-2024-kevin-hart-film/","urlToImage":"https://www.digitaltrends.com/wp-content/uploads/2024/01/Netflix-Lift-cast.jpeg?resize=1200%2C630&p=1","publishedAt":"2024-01-13T14:00:03Z","content":"Netflix\r\nThere is perhaps no genre more satisfying than the heist movie. These films are almost always rewarding, in part because seeing a team get put together and formulate a plan is usually satisf… [+2806 chars]"},{"source":{"id":"buzzfeed","name":"Buzzfeed"},"author":"Michaela Bramwell","title":"I Scoured The Internet To Find These 15 Hilarious Black Twitter Tweets That Will Have You Laughing Until The End Of The Week","description":"\"Black ppl when they see an actor playing in another movie: 'THAT'S UM...*snaps 3x*'\"View Entire Post ›","url":"https://www.buzzfeed.com/michaelabramwell/hilarious-black-twitter-tweets-jan-24","urlToImage":"https://img.buzzfeed.com/buzzfeed-static/static/2024-01/24/18/enhanced/da0c0a65b825/original-833-1706122092-3.png?crop=2420:1267;0,183%26downsize=1250:*","publishedAt":"2024-01-24T18:54:34Z","content":"Jamaicans rude AF! I went to Donnas and i said hello the the lady, she didnt respond. A few mins later she goes are you ready to order? I said I was ready to order when I said hello and she gone ask … [+102 chars]"},{"source":{"id":null,"name":"AppleInsider"},"author":"news@appleinsider.com (William Gallagher)","title":"'Still: A Michael J. Fox Movie' wins four Emmy Awards","description":"Apple TV+ took five more awards for \"Still\" and \"For All Mankind\" in the Creative Emmy's second night of honoring the best of television and film in 2023.Michael J. FoxFollowing its success for \"Ted Lasso\" in the first evening of the Creative Emmy Awards two-…","url":"https://appleinsider.com/articles/24/01/08/still-a-michael-j-fox-movie-wins-four-emmy-awards","urlToImage":"https://photos5.appleinsider.com/gallery/57986-118122-000-lede-Michael-J-Fox-xl.jpg","publishedAt":"2024-01-08T12:34:58Z","content":"Michael J. Fox\r\nApple TV+ took five more awards for \"Still\" and \"For All Mankind\" in the Creative Emmy's second night of honoring the best of television and film in 2023.\r\nFollowing its success for \"… [+964 chars]"},{"source":{"id":null,"name":"Boing Boing"},"author":"Mark Frauenfelder","title":"Candace Owens says the Munchkins in The Wizard of Oz are performing a \"satanic ritual\" (video)","description":"Candace Owens — MAGA's favorite virus epidemiologist and foreign policy expert — is now a beloved movie critic among Trump followers. The pro-Trump activist's recent analysis of The Wizard of Oz is a work of scholarship equaled only by Ben Shapiro's fascinati…","url":"https://boingboing.net/2024/01/17/candace-owens-says-the-munchkins-in-the-wizard-of-oz-are-performing-a-satanic-ritual-video.html","urlToImage":null,"publishedAt":"2024-01-17T20:16:19Z","content":"Candace Owens MAGA's favorite virus epidemiologist and foreign policy expert  is now a beloved movie critic among Trump followers. The pro-Trump activist's recent analysis of The Wizard of Oz is a wo… [+1104 chars]"},{"source":{"id":null,"name":"CNET"},"author":"Meara Isenberg","title":"'Oppenheimer' Streaming on Peacock: Release Date and Time - CNET","description":"It's nearly time to take in Christopher Nolan's epic thriller.","url":"https://www.cnet.com/tech/services-and-software/oppenheimer-streaming-on-peacock-release-date-and-time/","urlToImage":"https://www.cnet.com/a/img/resize/0e29944b231b9506dee786488e6c58b9967f024f/hub/2024/01/19/c414c6c4-0881-4ed7-a483-801114669f68/oppenheimer-promo-2.jpg?auto=webp&fit=crop&height=675&precrop=758,426,x0,y257&width=1200","publishedAt":"2024-01-19T20:11:19Z","content":"Max subscribers danced the night away with Barbie, and now Peacock subs are gaining the other inescapable movie of the summer: Christopher Nolan's Oppenheimer.\r\nOppenheimer stars Cillian Murphy as J.… [+7592 chars]"},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Love Island All Stars: ITV reveals names for 2024 series","description":"ITV's new series will see the return of islanders like Georgia Harrison, Kaz Kamwi and Anton Danyluk.","url":"https://www.bbc.co.uk/news/newsbeat-67911425","urlToImage":"https://ichef.bbci.co.uk/news/1024/branded_news/3004/production/_132229221_georgiapanews.jpg","publishedAt":"2024-01-08T11:55:31Z","content":"Georgia Harrison, Kaz Kamwi and Toby Aromolaran will be among past Love Islanders getting another chance at love in a new All Stars edition.\r\nITV announced the names of former contestants joining the… [+2845 chars]"},{"source":{"id":"polygon","name":"Polygon"},"author":"Tasha Robinson","title":"Inside Robot Dreams, the Oscars’ surprise Best Animated Feature nominee","description":"Wondering where to stream Robot Dreams after its Academy Awards nomination? Here’s why you can’t yet — and why it’s worth watching when you can.","url":"https://www.polygon.com/24049361/robot-dreams-best-animated-feature-nominee-release-date","urlToImage":"https://cdn.vox-cdn.com/thumbor/z-DFGRqo7hF6iH0CUxhFnJYST8k=/0x0:2500x1309/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25246158/RoboDreams.jpg","publishedAt":"2024-01-24T20:21:39Z","content":"If you buy something from a Polygon link, Vox Media may earn a commission. See our ethics statement.Every new batch of Academy Awards nominations comes with a few surprises. Film fans get up in arms … [+3251 chars]"}]}